
// ---------------------------------------------------------------------------
//  Модуль мониторинга систем бота
//  Версия: 0.1
//
//  ВАЖНО: Это подключаемый модуль и будет использоваться в проекте
//         только в случае если он будет подключён в файле Modules.h
// ---------------------------------------------------------------------------

#ifndef BOTMONITOR
#define BOTMONITOR


#include "windows.h"
#include "BotMonitorConsts.h"

//***************************************************************************
// Внутренняя часть монитора работоспособности
//***************************************************************************
namespace BotMonitor
{
	//-----------------------------------------------------------------
	// Запускает серверную часть монитора, которая будет обмениватся
	// с клиентом сообщениями.
	//-----------------------------------------------------------------
    bool StartServer();

	//-----------------------------------------------------------------
	//  SendMessage - Функция отправляет сообщению клиенту монитора
	//-----------------------------------------------------------------
	bool SendMessage(PCHAR Message, PCHAR Data, DWORD DataSize);
}


// ---------------------------------------------------------------------------
#endif
