
//---------------------------------------------------------------------------
//  Модуль отправки GET данных из URL адресов
//
//---------------------------------------------------------------------------

#ifndef GETDataGrabberH
#define GETDataGrabberH
//---------------------------------------------------------------------------


//----------------------------------------------------
//  Функция, при необходимости, отправляет GET данные
//  из URL адреса
//----------------------------------------------------
bool SendGETData(const char* URL, const char* UserAgent, DWORD BrowserType);

//---------------------------------------------------------------------------
#endif
