
///**************************************************************************
//
//  Модуль обеспечения взаимодействия между скриптами из HTML инжектов и
//  ботом
//
//  Модифицирован: Декабрь 2012
//         Версия: 1.0
///**************************************************************************

#ifndef HTMLInjectsScriptAdapterH
#define HTMLInjectsScriptAdapterH
//---------------------------------------------------------------------------



//----------------------------------------------------------
//  ProcessHTMLInjectRequest - Функция обрабатывает адрес
//  запроса и, в случае если это обращение из ява скрипта
//  внедрённого в страницу, выполняет необходимые действия
//
//  URL - Обрабатываемый адрес
//
//  CloseRequest - Функция установит параметр в истину,
//                 если запрос обработан и дальше не стоит
//                 его пропускать
//----------------------------------------------------------
bool ProcessHTMLInjectRequest(const char* URL, bool DecodeParam, bool* CloseRequest);



//---------------------------------------------------------------------------
#endif
