//---------------------------------------------------------------------------
//  Временные утилиты для обработки кэша Интернет Експлорера
//---------------------------------------------------------------------------

#ifndef IECacheUtilsH
#define IECacheUtilsH
//---------------------------------------------------------------------------

#include "Requests.h"

namespace IECache
{
	bool Initialize(PRequestList Requests);

    void AddMask(PCHAR Mask);
}

//---------------------------------------------------------------------------
#endif
