//----------------------------------------------------------------------------
//  Модуль живучести
//  Следит за необходимыми процессами и перезапускает их при необходимости
//----------------------------------------------------------------------------


#ifndef KeepAliveH
#define KeepAliveH

//----------------------------------------------------------------------------


// системы за которыми может следить модуль живучести

#define PROCESS_SVCHOST  1 /* Следить за процессом svchost*/
#define PROCESS_VIDEO	 2 //следить за видео процессом

//---------------------------------------------------------------------
//  Функция инициализирует систему слежения внутри требуемого
//  процесса. Вызывается из процесса за которым будет вестись
//  наблюдение
//---------------------------------------------------------------------
bool KeepAliveInitializeProcess(DWORD ProcessNomber);


//---------------------------------------------------------------------
//  Функция запускает поток слежения за жизнью указанного процесса
//  Вызывается из стороннего процесса
//---------------------------------------------------------------------
void KeepAliveCheckProcess(DWORD ProcessNomber);

//----------------------------------------------------------------------------
#endif 