

//****************************************************************************
//  Yandex.h - модуль включает грабер картинок яндекса
//
//  Для активации грабера необходимо включить модуль в модуле Modules.h
//  проекта
//****************************************************************************



#ifndef YandexH
#define YandexH
//----------------------------------------------------------------------------


namespace YandexSearchJpg
{
    bool Init();
}


//----------------------------------------------------------------------------
#endif
