
//*****************************************************************************
//  Модуль глобальных объявлений бота
//
//  Дата:   Апрель 2012
//  Версия: 1.0
//*****************************************************************************

#ifndef BotDefH
#define BotDefH
//-----------------------------------------------------------------------------



//********************************************
//  События HTML инжектов
//********************************************
#define BOT_EVENT_HTMLINJECTS_CLEAR    101    /* Очищен список HTML инжектов */
#define BOT_EVENT_HTMLINJECTS_LOADED   102    /* Загружен список HTML инжектов */
#define BOT_EVENT_HTMLINJECT_ACTIVATED 103    /* HTML инжект использован в документах */
#define BOT_EVENT_HTMLINJECT_EXECUTE   104    /* Выполнение HTML инжекта */


//********************************************
//  Имена полей HTML форм
//********************************************

const static char* HTTP_FIELD_UID     = "uid";
const static char* HTTP_FIELD_ANTIVIR = "av";
const static char* HTTP_FIELD_MD5     = "md5";

//-----------------------------------------------------------------------------
#endif
