
//---------------------------------------------------------------------------
//
//  Модуль отладки HTTP запросов
//  При включении модуля HTTP запросы будут доблироваться в файл
//
//---------------------------------------------------------------------------

#ifndef HTTPDebugH
#define HTTPDebugH
//---------------------------------------------------------------------------


#include "Windows.h"

//***********************************************************
//  HTTPDebug - Отладчик HTTP запросов
//***********************************************************
namespace HTTPDebug
{
	//--------------------------------------------------------
	// Initialize - Функция инициализирует файл для записи
	//			    HTTPданных
	//
	// FileName - Имя файла для записи лога
	//
	// Результат: В случае успеха функция вернёт идентификатор
	//			  открытого файла
	//
	// После окончания работы закрыть перехват функцией Close
	//--------------------------------------------------------
	HANDLE Initialize(PCHAR FileName);

	//--------------------------------------------------------
	// Close - Закрыть отладку
	//--------------------------------------------------------
	void Close();

	//--------------------------------------------------------
	//	Active - Функция вернёт истину если активна система
	//			 протоколирования данных
	//--------------------------------------------------------
	bool Active();

	//--------------------------------------------------------
	//  Write - Функция записывает данные в открытый файл
	//--------------------------------------------------------
    DWORD Write(LPVOID Buf, DWORD BufSize);
}


//---------------------------------------------------------------------------
#endif
