
//****************************************************************************
//  Модуль работы с библиотеками загруженными в память
//
//  Версия: 1.0.1
//  Модифицирован: Август 2012
//****************************************************************************


#ifndef LoaderDllH
#define LoaderDllH
//----------------------------------------------------------------------------

#include <windows.h>


typedef void* HMEMORYMODULE;

//-------------------------------------------------------
//  MemoryLoadLibrary - Функция загружает в память из
//                      переданного буфера памяти
//-------------------------------------------------------
HMEMORYMODULE MemoryLoadLibrary( const void* Memory, bool CallDllEntry = true, void* param = 0 );


//-------------------------------------------------------
//  MemoryGetProcAddress - Функция возвращает адрес
//                     функции зугруженной в память DLL
//-------------------------------------------------------
FARPROC MemoryGetProcAddress(HMEMORYMODULE Dll, const char* Name);
FARPROC MemoryGetProcAddress(HMEMORYMODULE Dll, DWORD NameHash);

//-------------------------------------------------------
//  MemoryFreeLibrary - Функция освобождает ресурсы
//                      выдеоенные для DLL в памяти
//-------------------------------------------------------
void MemoryFreeLibrary(HMEMORYMODULE);




//*******************************************************
//  Данные для работы с шифрованными DLL
//*******************************************************

//----------------------------------
//  Маркер DLL
//----------------------------------
#define ENCRYPTED_DLL_MARKER   "_DLL_DATA_"


//----------------------------------
//  Размер маркера DLL
//----------------------------------
#define ENCRYPTED_DLL_MARKER_SIZE 10

//----------------------------------
//  Хэш маркера DLL
//----------------------------------
#define ENCRYPTED_DLL_MARKER_HASH 0x8CAC120C /* _DLL_DATA_ */




//---------------------------------------------------------
//  Функция расшифровывает длл
//
//  DllBuf - Указатель на исходный буфер длл
//
//  Выходные параметры:
//
//  DllSize - размер расшифрованной длл
//  NewBuf  - Указатель на буфер длл
//  NewBufAllocated - Установится в истину, если
//                    для буфера пришлось выделить память
//---------------------------------------------------------
bool DecodeDll(const void* DllBuf, DWORD &DllSize, LPVOID &NewBuf, bool &NewBufAllocated);


HMEMORYMODULE MemoryLoadEncryptedLibrary( const void*);

//----------------------------------------------------------------------------
#endif